{
  "navigation": {
    "help": "Тусламж",
    "about": "Тайлбар",
    "oyuna": "Оюуна"
  },
  "chat": {
    "input": {
      "placeholder": "Юу асуумаар байна?"
    }
  },
  "disclaimer": {
    "title": "Сануулга",
    "pop_up_text": "Энэхүү чатбот нь сарын тэмдэгийн эрүүл мэндийн талаар ерөнхий мэдээлэл өгдөг. Энэ нь мэргэжлийн эмнэлгийн зөвлөгөөг орлуулахгүй. Хувийн эрүүл мэндийн асуудлуудад эмнэлгийн үйлчилгээ үзүүлэгчтэй зөвлөлдөөрэй.",
    "inline_text": "Таны хувийн нууцлал бидэнд чухал. Энэхүү сайтын хэрэглээний мэдээлэл хадгалагдахгүй.",
    "tooltip": "Бидэнд таны мэдээллийн нууцлал маш чухал. Энэхүү сайтын хэрэглээнийн мэдээлэл болон мэссэжүүд хадгалагдадгүй ба буцаан сэргээх боломжгүй. Туслалцаа хэрэгтэй бол манай багтай холбогдоно уу.",
    "select_role_text": "Сайн уу, Оюунаад тавтай морил. Үргэлжлүүлэхийн тулд тохирохыг сонгоно уу:",
    "option_for_myself": "Өөртөө зориулж",
    "option_parent": "Би бол эцэг эх",
    "option_teacher": "Би багш",
    "option_friend": "Найздаа зориулж",
    "age_group_title": "Бүлгээ сонгох",
    "select_age_group_text": "Баярлалаа. Танд хэрэгцээнд сайн тохируулын тулд өөрийн тохирох бүлэгээ сонгоно уу:",
    "age_group_primary": "Бага сургууль (12-оос доош насны)",
    "age_group_middle_school": "Дунд сургууль (13-15)",
    "age_group_high_school": "Ахлах сургууль (15-17)",
    "age_group_adult": "Би насанд хүрсэн хүн (18-аас дээш)",
    "final_title": "Чухал мэдээлэл"
  },
  "close": "Хаах",
  "error": {
    "network": "Уучлаарай, одоогоор сервертэй холбогдох гэж байгаа боловч асуудал гарч байна. Интернэт холболтоо шалгаад дахин оролдоно уу. Хэрэв асуудал үргэлжилбэл сервер дээр асуудал гарсан байж магадгүй.",
    "server": "Яанаа! Бидний талд алдаа гарлаа. Манай баг мэдэгдэж, засварлах ажилд орсон байна. Цаашид дахин оролдоно уу.",
    "invalid_input": "Би таны сүүлчийн мессежийг боловсруулж чадсангүй. Та үүнийг дахин томъёолж эсвэл илүү их контекст өгөх боломжтой юу?",
    "timeout": "Уучлаарай, таны хүсэлт хүлээгдэж байснаас удаан хугацаа шаардагдаж байна. Энэ нь өндөр ачаалал эсвэл төвөгтэй боловсруулалтаас үүдэлтэй байж болно. Цаг хугацаа өнгөрсний дараа дахин оролдоно уу.",
    "unknown": "Санаандгүй алдаа гарсан байна. Тав тухгүй байдал үүссэнд уучлал хүсэж байна. Та хүсэлтээ дахин илгээгээд, хэрэв асуудал үргэлжилбэл манай дэмжлэгийн багтай холбоо барина уу.",
    "rate_limit": "Та богино хугацаанд хэт олон мессеж илгээсэн байна. Дахин мессеж илгээхээсээ өмнө хэсэг хүлээж байгаарай.",
    "invalid_user": "Уучлаарай, би AI тул хариуцлагатай, аюулгүй AI хэрэглээг дагаж мөрдөх ёстой. Надад чатын функцийг ашиглахын тулд эцэг эхийн хяналт хэрэгтэй байна. Насанд хүрсэн хүнийг авчирч, тэднээр дамжуулан чатлах боломжийг аюулгүй ашиглана уу."
  },
  "feedback": {
    "title": "Танд үлдээх сэтгэгдэл байна уу?",
    "description": "5 минутын Google Form судалгаа",
    "button": "Судалгаанд оролцох"
  },
  "starter_bot_message": {
    "default": "Сайн байна уу! Намайг Оюуна гэдэг. Сарын тэмдэгтэй холбоотой асуултууддаа хариулт авахыг хүсвэл надтай ярилцаж болно. Та хэн бэ? (эмэгтэй хүн, эцэг эх, багш эсвэл эрэгтэй хүн эсэх ээ хэлж өгнө үү) Би танд туслахад бэлэн байна.",
    "option_for_myself": "Сайн байна уу! Намайг Оюуна гэдэг. Сарын тэмдгийн талаархи асуултуудад хариулахад би туслахад бэлэн байна. Та өөрийн биеийн өөрчлөлтүүдийг ойлгохыг хүсч байвал надтай ярилцаарай.",
    "option_parent" : "Сайн байна уу! Намайг Оюуна гэдэг. Хүүхдийн тань сарын тэмдгийн талаарх асуултуудад хариулахад бэлэн байна. Хэрэв та хүүхдээ энэ өөрчлөлтөд бэлдүүлэх эсвэл сэтгэл санааны дэмжлэг үзүүлэх талаар ярилцахыг хүсвэл надтай холбогдоорой.",
    "option_teacher": "Сайн байна уу! Намайг Оюуна гэдэг. Сургалтын орчинд сурагчдынхаа сарын тэмдгийн талаарх хэрэгцээг хангахад тань туслахад бэлэн байна. Хэрэв та сургалтын орчинд дэмжлэг үзүүлэх талаар зөвлөгөө авахыг хүсвэл надтай холбогдоорой.",
    "option_friend": "Сайн байна уу! Намайг Оюуна гэдэг. Найзуудынхаа сарын тэмдгийн талаар хэрхэн дэмжлэг үзүүлэх талаар зөвлөгөө авахыг хүсвэл надтай ярилцаарай. Би танд хэрхэн туслах талаар зөвлөгөө өгөхөд бэлэн байна."
  },
  "common_question": {
    "title": "Түгээмэл Асуултууд",
    "tagline": "Юу ч асууж болно гэдгийг санаарай. Эсвэл доорх асуултаас эхлээрэй",
    "one": "Сарын тэмдгийн өвдөлтийг хэрхэн намдаах вэ?",
    "two": "Эрүүл сарын тэмдгийн мөчлөг ямар байдаг вэ?",
    "three": "Хоолны дэглэм сарын тэмдэгт хэрхэн нөлөөлдөг вэ?",
    "four": "Сарын тэмдгийн талаар хэзээ эмчид хандах ёстой вэ?",
    "self": {
      "primary": {
        "first_period": "Эхний сарын тэмдгийн үеэр юу хүлээх вэ?",
        "period_pain": "Сарын тэмдгийн өвдөлт, зовиурыг хэрхэн даван туулах вэ?",
        "hygiene_basics": "Сарын тэмдгийн үеэр ариун цэврийг хэрхэн сахих вэ?",
        "period_products": "Эхлэгчдэд тохиромжтой сарын тэмдгийн бүтээгдэхүүнүүд юу вэ?"
      },
      "middle": {
        "irregular_periods": "Яагаад миний сарын тэмдэг тогтмол биш байдаг вэ, санаа зовох шаардлагатай юу?",
        "period_tracking": "Сарын тэмдгийн мөчлөгөө хэрхэн үр дүнтэй хянах вэ?",
        "school_management": "Сургууль дээрээ сарын тэмдгээ хэрхэн зохицуулах вэ?"
      },
      "high": {
        "pms_management": "PMS-ийн шинж тэмдгүүдийг даван туулах хамгийн сайн аргууд юу вэ?",
        "heavy_periods": "Хүчтэй сарын тэмдгийн урсгалыг хэрхэн зохицуулах вэ?",
        "exercise_periods": "Сарын тэмдгийн үед дасгал хийж болох уу, ямар урьдчилан сэргийлэх арга хэмжээ авах вэ?"
      },
      "adult": {
        "workplace_periods": "Ажлын байрандаа сарын тэмдгийг үр дүнтэй зохицуулах арга?",
        "menstrual_health": "Сайн сарын тэмдгийн эрүүл мэндийн шинж тэмдгүүд юу вэ?",
        "sustainable_products": "Байгальд ээлтэй сарын тэмдгийн бүтээгдэхүүнүүд юу байна вэ?"
      }
    },
    "parent": {
      "primary": {
        "first_period_prep": "Хүүхдээ анхны сарын тэмдэгт бэлдүүлэхэд яаж туслах вэ?",
        "period_talk": "Хүүхэдтэйгээ сарын тэмдгийн талаар яаж ярилцах вэ?",
        "emotional_support": "Сарын тэмдгийн үеэр сэтгэл санааны дэмжлэгийг хэрхэн үзүүлэх вэ?"
      },
      "middle": {
        "product_guidance": "Хүүхэддээ сарын тэмдгийн бүтээгдэхүүн сонгоход хэрхэн зөвлөгөө өгөх вэ?",
        "cycle_education": "Өсвөр насны хүүхдэд сарын тэмдгийн мөчлөгийг хэрхэн тайлбарлах вэ?",
        "school_support": "Сургууль дээр сарын тэмдгээ зохицуулахад хүүхдээ хэрхэн дэмжих вэ?"
      },
      "high": {
        "health_concerns": "Өсвөр насны хүүхдийн сарын тэмдгийн эрүүл мэндэд анхаарах зүйлс юу вэ?",
        "emotional_changes": "Сарын тэмдгийн сэтгэл санааны өөрчлөлтүүдийг даван туулахад хэрхэн туслах вэ?",
        "medical_advice": "Хүүхдийн сарын тэмдгийн асуудлаар хэзээ эмнэлгийн зөвлөгөө авах вэ?"
      },
      "adult": {
        "menstrual_disorders": "Сарын тэмдгийн эмгэгийн шинж тэмдгүүдийг хэрхэн таних вэ?",
        "reproductive_health": "Үржлийн эрүүл мэнд, сарын тэмдгийн талаар юу мэдэх хэрэгтэй вэ?",
        "healthcare_guidance": "Хүүхдээ сарын тэмдгийн эрүүл мэндийн үйлчилгээ авахад хэрхэн зөвлөгөө өгөх вэ?"
      }
    },
    "teacher": {
      "primary": {
        "classroom_support": "Сургалтын орчинд сарын тэмдэгтэй сурагчдыг хэрхэн дэмжих вэ?",
        "emergency_situations": "Сарын тэмдэгтэй холбоотой яаралтай үед сургуулийн орчинд хэрхэн арга хэмжээ авах вэ?",
        "education_resources": "Сарын тэмдгийн талаар заахад ямар эх сурвалжуудыг ашиглаж болох вэ?"
      },
      "middle": {
        "student_support": "Сарын тэмдгийн асуудалтай сурагчдыг хэрхэн дэмжих вэ?",
        "inclusive_environment": "Сарын тэмдэгт ээлтэй сургалтын орчинг хэрхэн бүрдүүлэх вэ?",
        "health_education": "Сарын тэмдгийн эрүүл мэндийн боловсролд юу оруулах хэрэгтэй вэ?"
      },
      "high": {
        "menstrual_awareness": "Сургуулийн орчинд сарын тэмдгийн мэдлэгийг хэрхэн түгээх вэ?",
        "student_accommodations": "Сарын тэмдэгтэй сурагчдад ямар дэмжлэг үзүүлж болох вэ?",
        "health_resources": "Сургуулийн орчинд ямар сарын тэмдгийн эрүүл мэндийн эх сурвалжууд байх хэрэгтэй вэ?"
      },
      "adult": {
        "workplace_policies": "Ажлын байранд сарын тэмдэгт ээлтэй бодлого хэрхэн хэрэгжүүлэх вэ?",
        "health_workshops": "Сарын тэмдгийн эрүүл мэндийн талаар үр дүнтэй семинар хэрхэн зохион байгуулах вэ?",
        "support_systems": "Ажлын байранд сарын тэмдэгтэй ажилтнуудыг дэмжих системүүд юу байх ёстой вэ?"
      }
    },
    "friend": {
      "primary": {
        "emergency_help": "Сарын тэмдгийн яаралтай үед найздаа хэрхэн туслах вэ?",
        "emotional_support": "Саяхан сарын тэмдэг нь эхэлсэн найзыгаа хэрхэн дэмжих вэ?",
        "basic_knowledge": "Найзуудаа дэмжихийн тулд сарын тэмдгийн үндсэн мэдлэгийг юунд сурах вэ?"
      },
      "middle": {
        "period_support": "Найзуудаа сарын тэмдгийн үед хэрхэн дэмжих вэ?",
        "product_sharing": "Найзуудтайгаа сарын тэмдгийн бүтээгдэхүүнүүдийг хуваалцахдаа хэрхэн зохицуулах вэ?",
        "comfort_tips": "Сарын тэмдэгтэй найзуудад ямар тайвшруулах зөвлөгөөг өгч болох вэ?"
      },
      "high": {
        "health_concerns": "Сарын тэмдгийн асуудлаар эмнэлгийн тусламж хэрэгтэй байгааг найзынхаа үед хэрхэн таних вэ?",
        "emotional_support": "PMS-ийн үед сэтгэл санааны дэмжлэгийг хэрхэн үзүүлэх вэ?",
        "practical_help": "Сарын тэмдгийн үед найзууддаа ямар практик тусламж үзүүлж болох вэ?"
      },
      "adult": {
        "health_awareness": "Найзуудынхаа дунд сарын тэмдгийн эрүүл мэндийн мэдлэгийг хэрхэн түгээх вэ?",
        "support_network": "Сарын тэмдэгтэй холбоотой асуудалд дэмжлэгийн сүлжээ хэрхэн бүрдүүлэх вэ?",
        "medical_guidance": "Найзууддаа сарын тэмдгийн эрүүл мэндийн зөвлөгөө өгөхөд хэрхэн туслах вэ?"
      }
    }
  }
}

